<span style="font-size:16px">| BCOR2030, Fall 2023</span>
<br>
<span style="font-size:45px"><b>Random Sampling</b></span><img style="float: right;padding-right:50px;" src="https://eccles.utah.edu/wp-content/themes/wptheme-avada5/logos/eccles_logo_footer.png" width="300">
<br>
<br>
<span style="font-size:18px; float:left;"><b>By Prof. Byoung-gyu Gong     </b></span>
<hr>
<br>
<br>
<br>
<span style="font-size:16px">Random sampling in python can be easily achieved by using 'pandas' library.</span>

<b>pip install pandas</b> - <span style="color:red"><i>Data table manipulation library</i></span>

In [2]:
# Load your library
import pandas as pd

## 1. How to load your data using pandas
<hr style="border-top: 0.1px dotted navy" />
<span style="font-size:16px">To load your data set in the csv format, you can use 'read_csv()' function in the pandas library. Before loading your data set, you should drag and drop the data file into your vscode project folder. Unless you move it to the project folder, the function will not be able to locate where your file is.</span>

In [3]:
df=pd.read_csv("EAI.csv")
print(df)

      Manager  Annual Salary Training Program
0         845        55724.9              Yes
1         686        56833.5              Yes
2        2338        49978.0               No
3        1612        54009.5              Yes
4         413        54842.2              Yes
...       ...            ...              ...
2495      713        46825.5              Yes
2496      250        56233.1              Yes
2497     1395        53109.5              Yes
2498     2131        51934.2               No
2499     1025        48571.4               No

[2500 rows x 3 columns]

## 2. Explore your data set.
<hr style="border-top: 0.1px dotted navy" />
<span style="font-size:16px">Functions such as <b>'type()'</b> and <b>'describe()'</b> can give you a brief and easy summary look of your data.</span>

In [4]:
type(df)
df.describe()

          Manager  Annual Salary
count  2500.00000    2500.000000
mean   1250.50000   51800.000000
std     721.83216    4000.000067
min       1.00000   40990.300000
25%     625.75000   49036.500000
50%    1250.50000   51837.300000
75%    1875.25000   54577.675000
max    2500.00000   63538.700000



## 3. Modify Your Data
<hr style="border-top: 0.1px dotted navy" />
<span style="font-size:16px">By using <b>'columns()'</b> function, we can change the column names. Also, you need to remember that the white space in the column name can cause problems at the modeling and other advanced data pre-processing stage. So, it is better to replace it with '_'.</span>

In [5]:
# Modify your data
# Modify your column names.
df.columns=["manager","annual_salary","training_program"]
print(df)

      manager  annual_salary training_program
0         845        55724.9              Yes
1         686        56833.5              Yes
2        2338        49978.0               No
3        1612        54009.5              Yes
4         413        54842.2              Yes
...       ...            ...              ...
2495      713        46825.5              Yes
2496      250        56233.1              Yes
2497     1395        53109.5              Yes
2498     2131        51934.2               No
2499     1025        48571.4               No

[2500 rows x 3 columns]



## 4. Random Sampling in pandas
<hr style="border-top: 0.1px dotted navy" />
<span style="font-size:16px">By using <b>'sample()'</b> function, we can randomly select specific number of rows or observations in the data table. The 'sample()' function does not select the same rows in default setting, 'replace=False'. You can specify the number of samples you'd like to select by number or fraction. </span>

In [7]:
df_sam=df.sample(10)

      manager  annual_salary training_program
898      1461        52973.1              Yes
1780     1734        52152.6              Yes
2220     2126        55665.9              Yes
614      1343        46042.1               No
2468      505        61739.3              Yes
1588     2166        44956.5               No
631       414        51258.1              Yes
1581     2463        48063.7               No
822      1906        46663.9               No
1682      787        53974.6              Yes

In [13]:
df_sam=df.sample(frac=0.005)
df_sam

      manager  annual_salary training_program
2270     2320        41978.2              Yes
1060     2144        53673.6               No
2193     1409        53007.3              Yes
1194     1718        51713.5              Yes
1573     1137        48739.3               No
2102      490        56427.5              Yes
115      1898        53606.3              Yes
2430     1131        54000.3               No
1667      680        49886.5              Yes
1120       88        58829.1              Yes
1404     1769        50264.3               No
1986       16        44652.5              Yes

## 5. Calculate Your Sample Statistics
<hr style="border-top: 0.1px dotted navy" />
<span style="font-size:16px">By using <b>'mean()'</b> function, we can calculate the mean of the selected column in the data table. You can select specific column by putting the column name in the <b>your_dataframe["your_selected_column"]</b>. </span>

In [11]:
df_sam["annual_salary"].mean()

52415.03199999999